{"requirements":"\"The airplane structure must be designed to be able to withstand the pressure differential loads corresponding to the maximum relief valve setting multiplied by a factor of 1.33 for airplanes to be approved for operation to 45,000 feet or by a factor of 1.67 for airplanes to be approved for operation above 45,000 feet, omitting other loads.\"","label":"Design"}
{"requirements":"\"The airplane, even when damaged in an emergency landing, must protect each occupant against injury that would preclude egress when the occupant experiences ultimate static inertia loads likely to occur in an emergency landing.\"","label":"Functional"}
{"requirements":"Identical powerplant controls for each engine must be located to prevent confusion as to the engines they control.","label":"Design"}
{"requirements":"Each fuel system must be designed and arranged to provide independence between multiple fuel storage and supply systems so that failure of any one component in one system will not result in loss of fuel storage or supply of another system.","label":"Design"}
{"requirements":"\"The steady gradient of climb may not be less than 2.1 percent for two-engine airplanes, 2.4 percent for three-engine airplanes, and 2.7 percent for four-engine airplanes, with a climb speed established in connection with normal landing procedures, but not exceeding 1.4 V_SR.\"","label":"Performance"}
{"requirements":"\"For each part that requires maintenance, preventive maintenance, or servicing, a means into the aircraft design must be incorporated to allow such actions to be accomplished.\"","label":"Functional"}
{"requirements":"The air induction system for each powerplant or auxiliary power unit and their accessories must provide an alternate intake if blockage of the primary intake is likely.","label":"Design"}
{"requirements":"\"Pressurized airplanes must be capable of continued safe flight and landing following a sudden release of cabin pressure, including sudden releases caused by door and window failures.\"","label":"Functional"}
{"requirements":"The airplane must be safely controllable and maneuverable during level flight.","label":"Performance"}
{"requirements":"\"Unless the failure of an automatic power or thrust control system is extremely remote, the system must provide a means for the flightcrew to verify the system is in an operating condition.\"","label":"Functional"}
{"requirements":"\"Trim tabs must be designed to withstand loads arising from all likely combinations of tab setting, primary control position, and airplane speed (obtainable without exceeding the flight load conditions prescribed for the airplane as a whole), when the effect of the tab is opposed by pilot effort forces up to those specified in Section 25-397(b).\"","label":"Design"}
{"requirements":"\"A means to extinguish fire within a fire zone, except a combustion heater fire zone, must be provided for any fire zone on a level 4 airplane.\"","label":"Functional"}
{"requirements":"\"Each fuel system must be designed and arranged to prevent ignition of the fuel within the system by direct lightning strikes or swept lightning strokes to areas where such occurrences are highly probable, or by corona or streamering at fuel vent outlets.\"","label":"Design"}
{"requirements":"\"Each stop must be located so that wear, slackness, or take-up adjustments will not adversely affect the control characteristics of the airplane because of a change in the range of surface travel.\"","label":"Design"}
{"requirements":"Each non-ejectable record container must be located and mounted so as to minimize the probability of container rupture resulting from crash impact and subsequent damage to the record from fire.","label":"Design"}
{"requirements":"There must be positive clearance between other rotating parts of the propeller or spinner and stationary parts of the airplane.","label":"Design"}
{"requirements":"Each cockpit voice recorder must be installed so that it has an independent power source that provides 10 +\/-1 minutes of electrical power to operate both the cockpit voice recorder and cockpit-mounted area microphone. ","label":"Performance"}
{"requirements":"\"The airplane must maintain longitudinal, directional, and lateral trim (and for the lateral trim, the angle of bank may not exceed five degrees) at 1.3 V_SR1 during climbing flight with the remaining engines at maximum continuous power.\"","label":"Performance"}
{"requirements":"Each cockpit voice recorder shall record voice or audio signals identifying navigation or approach aids introduced into a headset or speaker.","label":"Functional"}
{"requirements":"No airplane may exhibit any divergent longitudinal stability characteristic so unstable as to increase the pilot's workload or otherwise endanger the airplane and its occupants.","label":"Performance"}
{"requirements":"\"A means to extinguish fire within a fire zone, except a combustion heater fire zone, must be provided for any fire zone embedded within the fuselage, which must also include a redundant means to extinguish fire.\"","label":"Functional"}
{"requirements":"\"For level 4 airplanes, materials in the cockpit, cabin, baggage, and cargo compartments must be self-extinguishing.\"","label":"Functional"}
{"requirements":"The flight control systems and surfaces must be designed for the limit loads generated when the airplane is subjected to a horizontal 65-knot ground gust from any direction while taxiing and while parked.","label":"Design"}
{"requirements":"\"The pilot compartment must be constructed so that, when flying in rain or snow, it will not leak in a manner that will distract the crew or harm the structure.\"","label":"Design"}
{"requirements":"\"For turbojet reversing systems, each system intended for inflight use must be designed so that no unsafe condition will result during normal operation of the system, or from any failure (or reasonably likely combination of failures) of the reversing system, under any anticipated condition of operation of the airplane including ground operation.\"","label":"Functional"}
{"requirements":"\"In designated fire zones, terminals, equipment, and electrical cables used during emergency procedures must be fire-resistant.\"","label":"Functional"}
{"requirements":"\"If an adjustable stabilizer is used, it must have stops that will limit its range of travel to the maximum for which the airplane is shown to meet the trim requirements of Section 25-161.\"","label":"Design"}
{"requirements":"\"Each cockpit voice recorder shall record voice communications of flightcrew members on the flight deck, using the airplane's interphone system.\"","label":"Functional"}
{"requirements":"\"The design and installation of a fuel system must prevent catastrophic fuel vapor ignition due to lightning and its effects, including direct lightning strikes to areas having a high probability of stroke attachment.\"","label":"Design"}
{"requirements":"\"At each point along the takeoff path, starting at the point at which the airplane reaches 400 feet above the takeoff surface, the available gradient of climb may not be less than 1.2 percent for two-engine airplanes.\"","label":"Performance"}
{"requirements":"Each flight recorder must be installed so that it remains powered for as long as possible without jeopardizing emergency operation of the airplane.","label":"Design"}
{"requirements":"\"The control system must be designed for pilot forces applied in the same direction, using individual pilot forces not less than 0.75 times those obtained under Section 25-395.\"","label":"Design"}
{"requirements":"Each fuel system must provide at least 100 percent of the fuel flow required under each intended operating condition and maneuver.","label":"Performance"}
{"requirements":"Each flight recorder must be installed so that there is an aural or visual means for preflight checking of the recorder for proper recording of data in the storage medium. ","label":"Design"}
{"requirements":"Each projecting object that would injure persons seated or moving about the airplane in normal flight must be padded.","label":"Design"}
{"requirements":"Trim systems must provide a means to indicate the trim position with respect to the trim range.","label":"Functional"}
{"requirements":"\"The airplane must maintain longitudinal trim without further force upon, or movement of, the primary flight controls or corresponding trim controls by the pilot, or the flight control system during level flight.\"","label":"Functional"}
{"requirements":"\"At each point along the takeoff path, starting at the point at which the airplane reaches 400 feet above the takeoff surface, the available gradient of climb may not be less than 1.7 percent for four-engine airplanes.\"","label":"Performance"}
{"requirements":"\"There must be a clearance of at least 18 inches between each propeller and the water, unless compliance with Section 25-239(a) can be shown with a lesser clearance.\"","label":"Design"}
{"requirements":"\"The airplane must be longitudinally, directionally, and laterally stable in accordance with the provisions of Sections 25-173 through 25-177.\"","label":"Performance"}
{"requirements":"Hinges must have enough strength and rigidity for loads parallel to the hinge line.","label":"Design"}
{"requirements":"Each occupant protection system must perform its intended function and not create a hazard that could cause a secondary injury to an occupant.","label":"Functional"}
{"requirements":"A means to ensure the prompt detection of fire must be provided for each designated fire zone on a multiengine airplane where detection will mitigate likely hazards to the airplane.","label":"Functional"}
{"requirements":"Each fuel storage system must be isolated from personnel compartments and protected from hazards due to unintended temperature influences.","label":"Design"}
{"requirements":"\"Each dual control system must be designed for the pilots operating in opposition, using individual pilot forces not less than the minimum forces specified in Section 25-397(c).\"","label":"Design"}
{"requirements":"Each baggage and cargo compartment must be designed for its maximum weight of contents and for the critical load distributions at the maximum load factors corresponding to the flight and ground load conditions determined under this part.","label":"Design"}
{"requirements":"\"For level 4 airplanes, each windshield and its supporting structure directly in front of the pilot must withstand, without penetration, the impact equivalent to a two-pound bird when the velocity of the airplane is equal to the airplane's maximum approach flap speed.\"","label":"Performance"}
{"requirements":"\"Trim controls must be designed to prevent inadvertent or abrupt operation and to operate in the plane, and with the sense of motion, of the airplane.\"","label":"Design"}
{"requirements":"\"For turbojet reversing systems, each system must have means to prevent the engine from producing more than idle thrust when the reversing system malfunctions, except that it may produce any greater forward thrust that is shown to allow directional control to be maintained, with aerodynamic means alone, under the most critical reversing condition expected in operation.\"","label":"Functional"}
{"requirements":"Each fuel storage refilling or recharging system must be designed to prevent improper refilling or recharging.","label":"Design"}
{"requirements":"\"Secondary controls, such as wheel brake, spoiler, and tab controls, must be designed for the maximum forces that a pilot is likely to apply to those controls.\"","label":"Design"}
{"requirements":"\"The airplane must be free from flutter, control reversal, and divergence accounting for any critical failures or malfunctions.\"","label":"Performance"}
{"requirements":"\"Each fuel storage system must be designed to prevent significant loss of stored fuel from any vent system due to fuel transfer between fuel storage or supply systems, or under likely operating conditions.\"","label":"Design"}
{"requirements":"There must be a propeller speed limiting means at the governor.","label":"Functional"}
{"requirements":"\"With the cabin configured for takeoff or landing, the airplane must have means of egress, that can be readily located and opened from the inside and outside.\"","label":"Functional"}
{"requirements":"\"For airplanes intended for operation on land or water, the airplane must have controllable longitudinal and directional handling characteristics during taxi, takeoff, and landing operations.\"","label":"Performance"}
{"requirements":"\"Each removable bolt, screw, nut, pin, or other removable fastener must meet the locking requirements of Section 25-607.\"","label":"Design"}
{"requirements":"The structure must support limit loads without detrimental permanent deformation.","label":"Functional"}
{"requirements":"The pilot must have the capability to stop the powerplant in flight and restart the powerplant within an established operational envelope.","label":"Functional"}
{"requirements":"Spin characteristics in airplanes certified for aerobatics that includes spins must recover without exceeding limitations and may not result in unrecoverable spins due to pilot disorientation or incapacitation.","label":"Performance"}
{"requirements":"\"Each lift device control must be designed so that the pilots can place the device in any takeoff, en route, approach, or landing position established under Section 25-101(d).\"","label":"Design"}
{"requirements":"\"The airplane design, including the induction and inlet system, must prevent foreseeable accumulation of ice or snow that adversely affects powerplant operation.\"","label":"Functional"}
{"requirements":"\"There must be at least one inch radial clearance between the blade tips and the airplane structure, plus any additional radial clearance necessary to prevent harmful vibration.\"","label":"Design"}
{"requirements":"\"The control surfaces must be designed for the limit loads resulting from the flight conditions in Sections 25-331, 25-341(a) and (b), 25-349, and 25-351, considering the requirements for auxiliary aerodynamic surfaces, in Section 25-445.\"","label":"Design"}
{"requirements":"Each main float must have not less than five watertight compartments approximately equal in volume.","label":"Design"}
{"requirements":"\"The control surfaces must be designed for the limit loads resulting from the flight conditions in Sections 25-331, 25-341(a) and (b), 25-349, and 25-351, considering the requirements for loads parallel to hinge line, in Section 25-393.\"","label":"Design"}
{"requirements":"\"The record container must be located as far aft as practicable, but need not be aft of the pressurized compartment, and may not be where aft-mounted engines may crush the container upon impact.\"","label":"Design"}
{"requirements":"Each cockpit voice recorder must be installed so that it remains powered for as long as possible without jeopardizing emergency operation of the airplane.","label":"Performance"}
{"requirements":"Each lift and drag device control must be designed and located to make inadvertent operation improbable.","label":"Design"}
{"requirements":"Reliable means of stopping the airplane shall be performant enough to account for landing impacts.","label":"Performance"}
{"requirements":"\"Each removable bolt, screw, nut, pin, or other removable fastener must incorporate two separate locking devices if its loss could preclude continued flight and landing within the design limitations of the airplane using normal pilot skill and strength.\"","label":"Design"}
{"requirements":"The landing gear must provide stable support and control to the airplane during surface operation.","label":"Functional"}
{"requirements":"\"The steady gradient of climb may not be less than 2.1 percent for two-engine airplanes, 2.4 percent for three-engine airplanes, and 2.7 percent for four-engine airplanes, with landing gear retracted.\"","label":"Performance"}
{"requirements":"\"The airplane must have controllable stall characteristics in straight flight, turning flight, and accelerated turning flight.\"","label":"Performance"}
{"requirements":"\"The means used to limit the low pitch position of the propeller blades must be set so that the engine does not exceed 103 percent of the maximum allowable engine rpm or 99 percent of an approved maximum overspeed, whichever is greater, with the airplane stationary under standard atmospheric conditions with no wind.\"","label":"Design"}
{"requirements":"Each fuel system must be designed to retain fuel under all likely operating conditions and minimize hazards to the occupants during any survivable emergency landing. ","label":"Design"}
{"requirements":"\"High-speed airplanes must have recovery characteristics that do not result in structural damage or loss of control, beginning at any likely speed up to V_MO\/M_MO, following a high-speed trim upset for airplanes where dynamic pressure can impair the longitudinal trim system operation.\"","label":"Performance"}
{"requirements":"Each cockpit voice recorder must be installed so that it receives its electrical power from the bus that provides the maximum reliability for operation of the cockpit voice recorder without jeopardizing service to essential or emergency loads.","label":"Design"}
{"requirements":"Each flight recorder must be installed so that any single electrical failure external to the recorder does not disable both the cockpit voice recorder and the flight data recorder.","label":"Design"}
{"requirements":"Each control system must have stops that positively limit the range of motion of each movable aerodynamic surface controlled by the system.","label":"Performance"}
{"requirements":"Each fuel storage refilling or recharging system must be designed to prevent the occurrence of any hazard to the airplane or to persons during refilling or recharging.","label":"Design"}
{"requirements":"The structural design airspeeds must provide sufficient margin for the establishment of practical operational limiting airspeeds.","label":"Design"}
{"requirements":"The airplane structure must be strong enough to withstand the flight loads combined with pressure differential loads from zero up to the maximum relief valve setting.","label":"Design"}
{"requirements":"\"Each baggage and cargo compartment must protect any controls, wiring, lines, equipment, or accessories whose damage or failure would affect safe operations.\"","label":"Functional"}
{"requirements":"The air induction system for each powerplant or auxiliary power unit and their accessories must supply the air required by that powerplant or auxiliary power unit and its accessories under likely operating conditions.","label":"Performance"}
{"requirements":"Trim systems must provide a means to indicate the direction of trim control movement relative to airplane motion.","label":"Functional"}
{"requirements":"Each main float must have a buoyancy of 80 percent in excess of that required to support the maximum weight of the seaplane or amphibian in fresh water.","label":"Design"}
{"requirements":"An automatic power or thrust control system intended for in-flight use must be designed so no unsafe condition will result during normal operation of the system.","label":"Design"}
{"requirements":"The landing gear control must be located forward of the throttles and must be operable by each pilot when seated with seat belt and shoulder harness (if provided) fastened.","label":"Design"}
{"requirements":"Any position and anti-collision lights must have the fields of coverage to provide sufficient time for another aircraft to avoid a collision.","label":"Design"}
{"requirements":"Any position lights must include a red light on the left side of the airplane.","label":"Design"}
{"requirements":"A means to ensure the prompt detection of fire must be provided for each designated fire zone that contains a fire extinguisher.","label":"Functional"}
{"requirements":"The landing gear must remain extended throughout the accelerate-stop distance.","label":"Functional"}
{"requirements":"\"For levels 1,2, and 3, the airplane must maintain lateral and directional trim in cruise without further force upon, or movement of, the primary flight controls or corresponding trim controls by the pilot, or the flight control system.\"","label":"Functional"}
{"requirements":"Engines in a designated fire zone must remain attached to the airplane in the event of a fire.","label":"Functional"}
{"requirements":"\"Each tank must be able to withstand without failure the vibration, inertia, fluid, and structural loads that it may be subject to in operation.\"","label":"Performance"}
{"requirements":"The structure must be able to support ultimate loads without failure for at least 3 seconds.","label":"Performance"}
{"requirements":"\"Any position lights must include a white light facing aft, located on an aft portion of the airplane or on the wing tips.\"","label":"Design"}
{"requirements":"The propeller speed and pitch must be limited to values that will ensure safe operation under normal operating conditions.","label":"Design"}
{"requirements":"The aircraft shall supply directional data to the flight recorder.","label":"Functional"}
{"requirements":"Each fuel system must provide the fuel necessary to ensure each powerplant and auxiliary power unit functions properly in all likely operating conditions.","label":"Performance"}
{"requirements":"\"An oxygen system must be free from hazards in itself, in its method of operation, and its effect upon other components.\"","label":"Functional"}
{"requirements":"\"Seaplanes must be designed for the water loads developed during takeoff and landing, with the seaplane in any attitude likely to occur in normal operation.\"","label":"Design"}
{"requirements":"Any position and anti-collision lights must have the flash rate to provide sufficient time for another aircraft to avoid a collision.","label":"Design"}
{"requirements":"\"The exhaust system, including exhaust heat exchangers for each powerplant or auxiliary power unit, must provide a means to safely discharge potential harmful material.\"","label":"Functional"}
{"requirements":"\"The airplane must provide protection for all occupants, accounting for likely flight, ground, and emergency landing conditions.\"","label":"Functional"}
{"requirements":"\"The steady gradient of climb may not be less than 2.1 percent for two-engine airplanes, 2.4 percent for three-engine airplanes, and 2.7 percent for four-engine airplanes, with the maximum landing weight.\"","label":"Performance"}
{"requirements":"The airplane must be designed to minimize hazards to the airplane due to structural damage caused by high-energy fragments from an uncontained engine or rotating machinery failure.","label":"Design"}
{"requirements":"\"Each cockpit voice recorder must be installed so that there is an automatic means to simultaneously stop the recorder and prevent each erasure feature from functioning, within 10 minutes after crash impact.\"","label":"Functional"}
{"requirements":"Any position and anti-collision lights must have the colors to provide sufficient time for another aircraft to avoid a collision.","label":"Design"}
{"requirements":"Any taxi and landing lights must be designed and installed so they provide sufficient light for night operations.","label":"Design"}
{"requirements":"The structural design airspeeds must be sufficiently greater than the stalling speed of the airplane to safeguard against loss of control in turbulent air.","label":"Design"}
{"requirements":"\"For propeller reversing systems, each system intended for ground operation only must be designed so that no single failure (or reasonably likely combination of failures) or malfunction of the system will result in unwanted reverse thrust under any expected operating condition.\"","label":"Design"}
{"requirements":"\"Each component, line, fitting, and control subject to fire conditions must be designed and located to prevent hazards resulting from a fire, including any located adjacent to a designated fire zone that may be affected by fire within that zone.\"","label":"Design"}
{"requirements":"\"Each cockpit voice recorder shall record voice communications of flightcrew members using the passenger loudspeaker system, if there is such a system and if the fourth channel is available in accordance with the requirements of paragraph (c)(4)(ii) of this section.\"","label":"Functional"}
{"requirements":"Each fuel system must prevent hazardous contamination of the fuel supplied to each powerplant and auxiliary power unit.","label":"Functional"}
{"requirements":"The airplane must have a clear and distinctive stall warning that provides sufficient margin to prevent inadvertent stalling.","label":"Functional"}
{"requirements":"\"The airplane must be free from flutter, control reversal, and divergence at all speeds within and sufficiently beyond the structural design envelope.\"","label":"Performance"}
{"requirements":"\"The airplane must be designed to withstand any vibration and buffeting that might occur in any likely operating condition up to V_D\/M_D, including stall and probable inadvertent excursions beyond the boundaries of the buffet onset envelope.\"","label":"Design"}
{"requirements":"All airplanes must have a reliable means of stopping the airplane.","label":"Functional"}
{"requirements":"The tanks as mounted in the airplane must be able to withstand without failure or leakage an internal pressure 1.5 times the maximum operating pressure.","label":"Performance"}
{"requirements":"Each airplane must display in a conspicuous manner any placard and instrument marking necessary for operation.","label":"Design"}
{"requirements":"Combustion heater installations must be protected from uncontained fire.","label":"Design"}
{"requirements":"\"Doors, canopies, and exits must be protected against inadvertent opening in flight, unless shown to create no hazard when opened in flight.\"","label":"Design"}
{"requirements":"Any single failure or likely combination of failures of an automatic power or thrust control system must not prevent continued safe flight and landing of the airplane.","label":"Design"}
{"requirements":"Each fuel system must be arranged so that any air which is introduced into the system will not result in power interruption for more than 20 seconds for reciprocating engines.","label":"Performance"}
{"requirements":"\"The airplane must maintain longitudinal trim during a climb with maximum continuous power at a speed not more than 1.3 V_SR1, with the landing gear retracted, and the flaps retracted.\"","label":"Performance"}
{"requirements":"\"The airplane must be controllable and maneuverable, without requiring exceptional piloting skill, alertness, or strength, within the operating envelope at all loading conditions for which certification is requested.\"","label":"Functional"}
{"requirements":"\"Each component, line, fitting, and control subject to fire conditions must be fire resistant if carrying flammable fluids, gas, or air or required to operate in event of a fire.\"","label":"Functional"}
{"requirements":"Trim control systems must be designed to prevent creeping in flight.","label":"Design"}
{"requirements":"Each fuel storage system must be capable of jettisoning fuel safely if required for landing.","label":"Functional"}
{"requirements":"\"Wing flaps, their operating mechanisms, and their supporting structures must be designed for critical loads occurring in the conditions prescribed in Section 25-345, accounting for the loads occurring during transition from one flap position and airspeed to another.\"","label":"Design"}
{"requirements":"\"For seaplanes or amphibian airplanes, riding lights must provide a white light visible in clear atmospheric conditions.\"","label":"Functional"}
{"requirements":"\"There must be a means to extinguish any fire in the cabin such that the pilot, while seated, can easily access the fire extinguishing means.\"","label":"Design"}
{"requirements":"Each tank must have an expansion space of not less than 2 percent of the tank capacity.","label":"Design"}
{"requirements":"\"Hazardous accumulations of fluids, vapors, or gases must be isolated from the airplane and personnel compartments, and be safely contained or discharged.\"","label":"Design"}
{"requirements":"\"The airplane must provide each occupant with air at a breathable pressure, free of hazardous concentrations of gases, vapors, and smoke during normal operations and likely failures.\"","label":"Functional"}
{"requirements":"\"If provision is made for a second pilot, the airplane must be controllable with equal safety from either pilot seat.\"","label":"Functional"}
{"requirements":"The occupant protection system must allow for occupant egress and operator access.","label":"Design"}
{"requirements":"\"The power generation, storage, and distribution for any system must be designed and installed to ensure no single failure or malfunction of any one power supply, distribution system, or other utilization system will prevent the system from supplying the essential loads required for continued safe flight and landing.\"","label":"Design"}
{"requirements":"The airplane must be safely controllable and maneuverable during landing.","label":"Performance"}
{"requirements":"\"Vibration and buffeting, for operations up to V_D\/M_D, must not interfere with the control of the airplane or cause excessive fatigue to the flightcrew.\"","label":"Performance"}
{"requirements":"The propeller speed and pitch must be limited to values that will ensure compliance with the performance requirements of Sections 25-101 through Section 25-125.","label":"Design"}
{"requirements":"Spin characteristics in airplanes certified for aerobatics that includes spins must recover without exceeding limitations and may not result in unrecoverable spins with any typical use of the flight or engine power controls.","label":"Performance"}
{"requirements":"\"Each removable bolt, screw, nut, pin, or other removable fastener must incorporate two separate locking devices if its loss could result in reduction in pitch, yaw, or roll control capability or response below that required by Subpart B of this chapter.\"","label":"Design"}
{"requirements":"The airplane flight control systems must be designed to protect against likely hazards.","label":"Design"}
{"requirements":"Each flight recorder must be installed so that it is in a separate container from the cockpit voice recorder when both are required.","label":"Design"}
{"requirements":"Each cockpit voice recorder must be installed so that any single electrical failure external to the recorder does not disable both the cockpit voice recorder and the flight data recorder.","label":"Design"}
{"requirements":"\"The airplane design must protect occupants from serious injury due to damage to windshields, windows, and canopies.\"","label":"Functional"}
{"requirements":"Each stop must be able to withstand any loads corresponding to the design conditions for the control system.","label":"Design"}
{"requirements":"\"For level 4 airplanes, each baggage and cargo compartment must be accessible for the manual extinguishing of a fire, have a built-in fire extinguishing system, or be constructed and sealed to contain any fire within the compartment.\"","label":"Design"}
{"requirements":"Each reversing system must be designed so that no unsafe condition will result during normal operation of the system.","label":"Design"}
{"requirements":"Augmentation system drains must be designed and located in accordance with Section 25-1455 if the fluid may be drained in flight or during ground operation.","label":"Design"}
{"requirements":"\"The control surfaces must be designed for the limit loads resulting from the flight conditions in Sections 25-331, 25-341(a) and (b), 25-349, and 25-351, considering the requirements for pilot effort effects, in Section 25-397.\"","label":"Design"}
{"requirements":"The airplane must be protected against catastrophic effects from lightning.","label":"Design"}
{"requirements":"\"Each tire installed on a retractable landing gear system must, at the maximum size of the tire type expected in service, have a clearance to surrounding structure and systems that is adequate to prevent unintended contact between the tire and any part of the structure or systems.\"","label":"Design"}
{"requirements":"Movable tail surfaces must be installed so that there is no interference between any surfaces when one is held in its extreme position and the others are operated through their full angular movement.","label":"Design"}
{"requirements":"Trim systems must provide a means to indicate the range for takeoff for all applicant requested center of gravity ranges and configurations.","label":"Functional"}
{"requirements":"\"During the takeoff path determination in accordance with paragraphs (a) and (b) of this section, the airplane must reach V_2 before it is 35 feet above the takeoff surface and must continue at a speed as close as practical to, but not less than V_2, until it is 400 feet above the takeoff surface.\"","label":"Performance"}
{"requirements":"The flightcrew interface design must allow for continued safe flight and landing after the loss of vision through any one of the windshield panels.","label":"Functional"}
{"requirements":"\"The airplane must maintain longitudinal trim without further force upon, or movement of, the primary flight controls or corresponding trim controls by the pilot, or the flight control system during climb.\"","label":"Functional"}
{"requirements":"\"The airplane must maintain longitudinal trim during a climb with maximum continuous power at a speed not more than 1.3 V_SR1, with the landing gear retracted, and the flaps in the takeoff position.\"","label":"Performance"}
{"requirements":"\"The design must clearly indicate the function of each cockpit control, other than primary flight controls.\"","label":"Design"}
{"requirements":"Equipment containing high-energy rotors must be designed or installed to protect the occupants and airplane from uncontained fragments. ","label":"Design"}
{"requirements":"\"Each fuel system must provide the flightcrew with a means to determine the total useable fuel available and provide uninterrupted supply of that fuel when the system is correctly operated, accounting for likely fuel fluctuations.\"","label":"Functional"}
{"requirements":"Each cockpit voice recorder must be installed so that it has an independent power source that is located as close as practicable to the cockpit voice recorder.","label":"Design"}
{"requirements":"\"The pilot compartment, its equipment, and its arrangement to include pilot view, must allow each pilot to perform his or her duties, including taxi, takeoff, climb, cruise, descent, approach, landing, and perform any maneuvers within the operating envelope of the airplane, without excessive concentration, skill, alertness, or fatigue.\"","label":"Functional"}
{"requirements":"The airplane must be safely controllable and maneuverable during climb.","label":"Performance"}
{"requirements":"\"The airplane must be designed to withstand any forced structural vibration resulting from any failure, malfunction or adverse condition in the flight control system.\"","label":"Design"}
{"requirements":"Each cockpit voice recorder shall record datalink messages as the output signal from the communications unit that translates the signal into usable data.","label":"Functional"}
{"requirements":"\"The airplane flight control systems must be designed to operate easily, smoothly, and positively enough to allow proper performance of their functions.\"","label":"Design"}
{"requirements":"\"Each dual control system must be designed for the pilots operating in opposition, using individual pilot forces not less than 0.75 times those obtained under Section 25-395.\"","label":"Design"}
{"requirements":"All lights must be designed and installed to minimize any adverse effects on the performance of flightcrew duties.","label":"Design"}
{"requirements":"\"Safety and survival equipment must be reliable, readily accessible, easily identifiable, and clearly marked to identify its method of operation.\"","label":"Design"}
{"requirements":"\"The structure supporting any engine or auxiliary power unit must be designed for the loads, including gyroscopic loads, arising from the conditions specified in Sections 25-331, 25-341, 25-349, 25-351, 25-473, 25-479, and 25-481, with the engine or auxiliary power unit at the maximum rotating speed appropriate to the condition.\"","label":"Design"}
{"requirements":"\"The control surfaces must be designed for the limit loads resulting from the flight conditions in Sections 25-331, 25-341(a) and (b), 25-349, and 25-351, considering the requirements for unsymmetrical loads, in Section 25-427.\"","label":"Design"}
{"requirements":"\"For empennage arrangements where the horizontal tail surfaces have dihedral angles greater than plus or minus 10 degrees, or are supported by the vertical tail surfaces, the surfaces and the supporting structure must be designed for gust velocities specified in Section 25-341(a) acting in any orientation at right angles to the flight path.\"","label":"Design"}
{"requirements":"\"The landing gear system must be designed so that when it fails due to overloads during takeoff and landing, the failure mode is not likely to cause spillage of enough fuel to constitute a fire hazard.\"","label":"Design"}
{"requirements":"Each cockpit control must be located to provide convenient operation and to prevent confusion and inadvertent operation.","label":"Design"}
{"requirements":"\"The seat and restraint system in the airplane must be designed to protect each occupant during an emergency landing condition when proper use is made of seats, safety belts, and shoulder harnesses provided for in the design.\"","label":"Design"}
{"requirements":"The airplane must be designed for the unsymmetrical loads resulting from the failure of the critical engine.","label":"Design"}
{"requirements":"\"The airplane, even when damaged in an emergency landing, must protect each occupant against injury that would preclude egress when items of mass, including engines or auxiliary power units (APUs), within or aft of the cabin, that could injure an occupant, experience ultimate static inertia loads likely to occur in an emergency landing.\"","label":"Functional"}
{"requirements":"Airplanes not certified for aerobatics must have dynamic short period and dutch roll stability in normal operations.","label":"Performance"}
{"requirements":"\"For level 4 airplanes, each baggage and cargo compartment must be located where a fire would be visible to the pilots, or equipped with a fire detection system and warning system.\"","label":"Design"}
{"requirements":"\"There must be a clearance of at least seven inches (for each airplane with nose wheel landing gear) or nine inches (for each airplane with tail wheel landing gear) between each propeller and the ground with the landing gear statically deflected and in the level takeoff, or taxiing attitude, whichever is most critical.\"","label":"Design"}
{"requirements":"\"For levels 1, 2, and 3 airplanes, materials in the baggage and cargo compartments inaccessible in flight must be self-extinguishing.\"","label":"Functional"}
{"requirements":"\"A means to extinguish fire within a fire zone, except a combustion heater fire zone, must be provided for any fire zone located outside the pilot's view.\"","label":"Functional"}
{"requirements":"Each baggage and cargo compartment must have a means to prevent the contents of the compartment from becoming a hazard by impacting occupants or shifting.","label":"Functional"}
{"requirements":"\"Each area where flammable fluids or vapors might escape by leakage of a fluid system must have a means to minimize the probability of fluid and vapor ignition, and the resultant hazard, if ignition occurs.\"","label":"Functional"}
{"requirements":"Airplanes not certified for aerobatics must provide stable control force feedback throughout the operating envelope.","label":"Performance"}
{"requirements":"Airplanes approved for aerobatics must have a means to egress the airplane in flight.","label":"Functional"}
{"requirements":"Trim systems must provide a means to indicate the neutral position for lateral and directional trim.","label":"Functional"}
{"requirements":"Propeller speed limiting means at the governor must limit the maximum possible governed engine speed to a value not exceeding the maximum allowable r.p.m.","label":"Functional"}
{"requirements":"The aircraft shall supply airspeed data to the flight recorder.","label":"Functional"}
{"requirements":"\"Each element of each flight control system must be designed, or distinctively and permanently marked, to minimize the probability of incorrect assembly that could result in the malfunctioning of the system.\"","label":"Design"}
{"requirements":"\"At each point along the takeoff path, starting at the point at which the airplane reaches 400 feet above the takeoff surface, the available gradient of climb may not be less than 1.5 percent for three-engine airplanes.\"","label":"Performance"}
{"requirements":"\"Trim systems must protect against inadvertent, incorrect, or abrupt trim operation.\"","label":"Functional"}
{"requirements":"\"The airplane must maintain longitudinal, directional, and lateral trim (and for the lateral trim, the angle of bank may not exceed five degrees) at 1.3 V_SR1 during climbing flight with the landing gear and flaps retracted.\"","label":"Performance"}
{"requirements":"\"The means used to limit the low pitch position of the propeller blades must be set so that the engine does not exceed 103 percent of the maximum allowable engine rpm or 99 percent of an approved maximum overspeed, whichever is greater, with the propeller blades at the low pitch limit and governor inoperative.\"","label":"Design"}
{"requirements":"The installed powerplant must operate without any hazardous characteristics during normal and emergency operation within the range of operating limitations for the airplane and the engine.","label":"Performance"}
{"requirements":"An oxygen system must effectively provide oxygen to each user to prevent the effects of hypoxia.","label":"Functional"}
{"requirements":"\"The airplane must maintain longitudinal, directional, and lateral trim (and for the lateral trim, the angle of bank may not exceed five degrees) at 1.3 V_SR1 during climbing flight with the critical engine inoperative.\"","label":"Performance"}
{"requirements":"The airplane must be designed for a maneuvering load factor of 1.5 g at the maximum take-off weight with the wing-flaps and similar high lift devices in the landing configurations.","label":"Design"}
{"requirements":"\"Each part of the airplane, including small parts such as fasteners, must be protected against deterioration or loss of strength due to any cause likely to occur in the expected operational environment.\"","label":"Design"}
{"requirements":"Balancing tabs must be designed for deflections consistent with the primary control surface loading conditions.","label":"Design"}
{"requirements":"The state estimates supplied to the flight recorder shall meet the aircraft level system requirements and the functionality specified in Section 23-2500.","label":"Design"}
{"requirements":"Each fuel storage system must withstand the loads under likely operating conditions without failure.","label":"Performance"}
{"requirements":"The landing gear must account for likely system failures and likely operation environments including anticipated limitation exceedances and emergency procedures.","label":"Functional"}
{"requirements":"The airplane must be designed so that it is controllable if all engines fail.","label":"Performance"}
{"requirements":"The airplane must be safely controllable and maneuverable during descent.","label":"Performance"}
{"requirements":"\"Wing flap controls and other auxiliary lift device controls must be located on top of the pedestal, aft of the throttles, centrally or to the right of the pedestal centerline, and not less than 10 inches aft of the landing gear control.\"","label":"Design"}
{"requirements":"Pressurized systems must withstand appropriate proof and burst pressures. ","label":"Performance"}
{"requirements":"\"Pressurized airplanes with maximum operating altitude greater than 41000 feet, must be capable of detecting damage to the pressurized cabin structure before the damage could result in rapid decompression that would result in serious or fatal injuries.\"","label":"Functional"}
{"requirements":"There must be at least one-half inch longitudinal clearance between the propeller blades or cuffs and stationary parts of the airplane.","label":"Design"}
{"requirements":"\"Airplanes intended for operations on water, must have sufficient margin so the airplane will stay afloat at rest in calm water without capsizing in case of a likely float or hull flooding.\"","label":"Design"}
{"requirements":"\"The control system must be free from jamming, excessive friction, and excessive deflection when the airplane is subjected to expected limit airloads.\"","label":"Functional"}
{"requirements":"Vibration and noise characteristics of cockpit equipment may not interfere with safe operation of the airplane.","label":"Design"}
{"requirements":"\"The airplane must be free from flutter, control reversal, and divergence accounting for critical degrees of freedom.\"","label":"Performance"}
{"requirements":"Each fuel storage system must provide fuel for at least one-half hour of operation at maximum continuous power or thrust.","label":"Performance"}
{"requirements":"\"The airplane must be designed to withstand the limit load conditions resulting from the static ground load conditions of paragraph (b) of this section and, if applicable, paragraph (c) of this section at the most critical combinations of airplane weight and center of gravity.\"","label":"Design"}
{"requirements":"\"Flight controls, engine mounts, and other flight structures within or adjacent to designated fire zones must be capable of withstanding the effects of a fire.\"","label":"Functional"}
{"requirements":"Any position and anti-collision lights must have the intensities to provide sufficient time for another aircraft to avoid a collision.","label":"Design"}
{"requirements":"The structure must be able to support limit loads without detrimental permanent deformation.","label":"Performance"}
{"requirements":"Each fluid injection system must provide a flow of fluid at the rate and pressure established for proper engine functioning under each intended operating condition.","label":"Functional"}
{"requirements":"Any equipment associated with any electrical cable installation and that would overheat in the event of circuit overload or fault must be flame resistant.","label":"Functional"}
{"requirements":"Each part of the airplane must have adequate provisions for ventilation and drainage.","label":"Design"}
{"requirements":"Each cockpit voice recorder must be installed so that there is an aural or visual means for preflight checking of the recorder for proper operation.","label":"Design"}
{"requirements":"\"For levels 1, 2 and 3 airplanes, materials in each compartment accessible in flight must be flame resistant.\"","label":"Functional"}
{"requirements":"Each fuel storage refilling or recharging system must be designed to prevent contamination of the fuel stored during likely operating conditions.","label":"Design"}
{"requirements":"The structure must support ultimate loads.","label":"Functional"}
{"requirements":"\"For level wing stalls, the roll occurring between the stall and the completion of the recovery may not exceed approximately 20 degrees.\"","label":"Performance"}
{"requirements":"Each cockpit voice recorder shall record voice communications of flightcrew members on the flight deck.","label":"Functional"}
{"requirements":"\"The airplane must maintain longitudinal trim without further force upon, or movement of, the primary flight controls or corresponding trim controls by the pilot, or the flight control system during approach.\"","label":"Functional"}
{"requirements":"\"There must be a means to extinguish any fire in the cabin such that for levels 3 and 4 airplanes, passengers have a fire extinguishing means available within the passenger compartment.\"","label":"Design"}
{"requirements":"\"Each recorder container must have an underwater locating device, when required by the operating rules of this chapter, on or adjacent to the container, which is secured in such manner that they are not likely to be separated during crash impact.\"","label":"Functional"}
{"requirements":"\"Each component, line, fitting, and control subject to fire conditions must be fireproof if storing concentrated flammable fluids.\"","label":"Functional"}
{"requirements":"\"The airplane, even when damaged in an emergency landing, must protect each occupant against injury that would preclude egress when properly using safety equipment and features provided for in the design.\"","label":"Functional"}
{"requirements":"\"The steady gradient of climb may not be less than 2.1 percent for two-engine airplanes, 2.4 percent for three-engine airplanes, and 2.7 percent for four-engine airplanes, with the critical engine inoperative, the remaining engines at the go-around power or thrust setting.\"","label":"Performance"}
{"requirements":"\"Each recorder container must have an underwater locating device, when required by the operating rules of this chapter, on or adjacent to the container, which is secured in such a manner that they are not likely to be separated during crash impact.\"","label":"Design"}
{"requirements":"\"The airplane powerplant installation must include each component necessary for propulsion, which affects propulsion safety, or provides auxiliary power to the airplane.\"","label":"Design"}
{"requirements":"The airplane design must protect the pilot and flight controls from propellers.","label":"Functional"}
{"requirements":"Trim tab controls must be irreversible unless the tab is appropriately balanced and shown to be free from flutter.","label":"Design"}
{"requirements":"The airplane must be safely controllable and maneuverable during takeoff. ","label":"Performance"}
{"requirements":"\"Airplanes not certified for aerobatics must have static longitudinal, lateral, and directional stability in normal operations.\"","label":"Performance"}
{"requirements":"Each part of the airplane near the propeller tips must be strong and stiff enough to withstand the effects of the induced vibration and of ice thrown from the propeller.","label":"Design"}
{"requirements":"The air induction system for each powerplant or auxiliary power unit and their accessories must minimize the ingestion of foreign matter.","label":"Functional"}
{"requirements":"\"High-speed airplanes must have recovery characteristics that do not result in structural damage or loss of control, beginning at any likely speed up to V_MO\/M_MO, following an inadvertent speed increase.\"","label":"Performance"}
{"requirements":"Each flight recorder must be installed so that it receives its electrical power from the bus that provides the maximum reliability for operation of the flight data recorder without jeopardizing service to essential or emergency loads.","label":"Design"}
{"requirements":"The brake controls must be designed and constructed so that excessive control force is not required for their operation.","label":"Design"}
{"requirements":"Each recorder container must be either bright orange or bright yellow. ","label":"Design"}
{"requirements":"Pressurization system must be designed to protect against decompression to an unsafe level.","label":"Design"}
{"requirements":"\"Unless the failure of an automatic power or thrust control system is extremely remote, the system must prevent inadvertent deactivation of the system.\"","label":"Functional"}
{"requirements":"\"The system and equipment design must minimize flightcrew errors, which could result in additional hazards.\"","label":"Functional"}
{"requirements":"Each recorder container must have reflective tape affixed to its external surface to facilitate its location under water.","label":"Design"}
{"requirements":"Control surfaces and supporting hinge brackets must be designed for inertia loads acting parallel to the hinge line.","label":"Design"}
{"requirements":"Pressurization system must be designed to protect against excessive differential pressure.","label":"Design"}
{"requirements":"\"Indication systems that integrate the display of flight or powerplant parameters to operate the airplane or are required by the operating rules of this chapter must in combination with other systems, be designed and installed so information essential for continued safe flight and landing will be available to the flightcrew in a timely manner after any single failure or probable combination of failures.\"","label":"Design"}
{"requirements":"\"The airplane must be controllable and maneuverable, without requiring exceptional piloting skill, alertness, or strength, within the operating envelope with likely reversible flight control or propulsion system failure.\"","label":"Functional"}
{"requirements":"Each safety belt must be equipped with a metal to metal latching device.","label":"Design"}
{"requirements":"\"The airplane must be controllable and maneuverable, without requiring exceptional piloting skill, alertness, or strength, within the operating envelope during configuration changes.\"","label":"Functional"}
{"requirements":"Any position lights must include a green light on the right side of the airplane.","label":"Design"}
{"requirements":"\"Single-engine airplanes, not certified for aerobatics, must not have a tendency to inadvertently depart controlled flight.\"","label":"Performance"}
{"requirements":"\"The microphone must be so located and, if necessary, the preamplifiers and filters of the recorder must be so adjusted or supplemented, so that the intelligibility of the recorded communications is as high as practicable when recorded under flight cockpit noise conditions and played back.\"","label":"Performance"}
{"requirements":"\"With the cabin configured for takeoff or landing, the airplane must have easy access to emergency exits when present.\"","label":"Functional"}
{"requirements":"\"The power generation, storage, and distribution for any system must be designed and installed to have enough capacity, if the primary source fails, to supply essential loads, including non-continuous essential loads for the time needed to complete the function required for continued safe flight and landing.\"","label":"Design"}
{"requirements":"\"The powerplant installation design must prevent any accumulation of ice or snow that adversely affects powerplant operation, in those icing conditions for which certification is requested.\"","label":"Functional"}
{"requirements":"\"The turbine engine air inlet system may not, as a result of air flow distortion during normal operation, cause vibration harmful to the engine.\"","label":"Functional"}
{"requirements":"\"The airplane must maintain longitudinal trim without further force upon, or movement of, the primary flight controls or corresponding trim controls by the pilot, or the flight control system during descent.\"","label":"Functional"}
{"requirements":"\"Each flight recorder must be installed so that the vertical acceleration sensor is rigidly attached, and located longitudinally either within the approved center of gravity limits of the airplane, or at a distance forward or aft of these limits that does not exceed 25 percent of the airplane's mean aerodynamic chord.\"","label":"Design"}
{"requirements":"Each pilot compartment and its equipment must allow the minimum flight crew (established under Section 25-1523) to perform their duties without unreasonable concentration or fatigue.","label":"Design"}
{"requirements":"\"A powerplant, auxiliary power unit, or combustion heater that includes a flammable fluid and an ignition source for that fluid must be installed in a designated fire zone.\"","label":"Design"}
{"requirements":"Insulation on electrical wire and electrical cable must be self-extinguishing.","label":"Functional"}
{"requirements":"\"The control surfaces must be designed for the limit loads resulting from the flight conditions in Sections 25-331, 25-341(a) and (b), 25-349, and 25-351, considering the requirements for trim tab effects, in Section 25-407.\"","label":"Design"}
{"requirements":"Each cockpit voice recorder must be installed so that it has an independent power source to which the cockpit voice recorder and cockpit-mounted area microphone are switched automatically in the event that all other power to the cockpit voice recorder is interrupted either by normal shutdown or by any other loss of power to the electrical power bus.","label":"Functional"}
{"requirements":"\"Each reversing system must be designed so that the airplane is capable of continued safe flight and landing after any single failure, likely combination of failures, or malfunction of the reversing system.\"","label":"Design"}
{"requirements":"Indication systems that integrate the display of flight or powerplant parameters to operate the airplane must not inhibit the primary display of flight or powerplant parameters needed by any flightcrew member in any normal mode of operation.","label":"Functional"}
{"requirements":"The airplane must be able to complete a landing without causing substantial damage or serious injury using the steepest approved approach gradient procedures and providing a reasonable margin below V_ref or above approach angle of attack.","label":"Performance"}
{"requirements":"For airplanes that have a system that actuates the landing gear there must be an alternative means available to bring the landing gear in the landing position when a non-deployed system position would be a hazard.","label":"Design"}
{"requirements":"\"Unless the failure of an automatic power or thrust control system is extremely remote, the system must provide a means for the flightcrew to override the automatic function.\"","label":"Functional"}
